BVO93/TI_CC2640R2_GetttingStarted/tirtos_builds_CC2640R2_LAUNCHXL_release_gcc/Debug/configPkg/package/cfg/release_pm3g.c
/* Module__diagsIncluded__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__diagsIncluded ti_sysbios_family_arm_cc26xx_Seconds_Module__diagsIncluded__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__diagsIncluded__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__diagsIncluded ti_sysbios_family_arm_cc26xx_Seconds_Module__diagsIncluded__C = (xdc_Bits32)0x90;

/* Module__diagsMask__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__diagsMask ti_sysbios_family_arm_cc26xx_Seconds_Module__diagsMask__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__diagsMask__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__diagsMask ti_sysbios_family_arm_cc26xx_Seconds_Module__diagsMask__C = ((const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__diagsMask)NULL);

/* Module__gateObj__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__gateObj ti_sysbios_family_arm_cc26xx_Seconds_Module__gateObj__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__gateObj__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__gateObj ti_sysbios_family_arm_cc26xx_Seconds_Module__gateObj__C = ((const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__gateObj)NULL);

/* Module__gatePrms__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__gatePrms ti_sysbios_family_arm_cc26xx_Seconds_Module__gatePrms__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__gatePrms__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__gatePrms ti_sysbios_family_arm_cc26xx_Seconds_Module__gatePrms__C = ((const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__gatePrms)NULL);

/* Module__id__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__id ti_sysbios_family_arm_cc26xx_Seconds_Module__id__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__id__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__id ti_sysbios_family_arm_cc26xx_Seconds_Module__id__C = (xdc_Bits16)0x28;

/* Module__loggerDefined__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerDefined ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerDefined__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerDefined__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerDefined ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerObj ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerObj__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerObj__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerObj ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerObj__C = ((const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerObj)NULL);

/* Module__loggerFxn0__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn0 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn0__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn0__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn0 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn0__C = ((const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn0)NULL);

/* Module__loggerFxn1__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn1 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn1__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn1__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn1 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn1__C = ((const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn1)NULL);

/* Module__loggerFxn2__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn2 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn2__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn2__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn2 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn2__C = ((const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn2)NULL);

/* Module__loggerFxn4__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn4 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn4__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn4__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn4 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn4__C = ((const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn4)NULL);

/* Module__loggerFxn8__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn8 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn8__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn8__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn8 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn8__C = ((const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn8)NULL);

/* Object__count__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__count ti_sysbios_family_arm_cc26xx_Seconds_Object__count__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Object__count__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__count ti_sysbios_family_arm_cc26xx_Seconds_Object__count__C = 0;

/* Object__heap__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__heap ti_sysbios_family_arm_cc26xx_Seconds_Object__heap__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Object__heap__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__heap ti_sysbios_family_arm_cc26xx_Seconds_Object__heap__C = NULL;

