BVO93/TI_CC2640R2_GetttingStarted/tirtos_builds_CC2640R2_LAUNCHXL_release_gcc/Debug/configPkg/package/cfg/release_pm3g.c
/* defaultStackHeap__C */
const CT__ti_sysbios_knl_Task_defaultStackHeap ti_sysbios_knl_Task_defaultStackHeap__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_defaultStackHeap__C")));
__FAR__ const CT__ti_sysbios_knl_Task_defaultStackHeap ti_sysbios_knl_Task_defaultStackHeap__C = 0;

/* allBlockedFunc__C */
const CT__ti_sysbios_knl_Task_allBlockedFunc ti_sysbios_knl_Task_allBlockedFunc__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_allBlockedFunc__C")));
__FAR__ const CT__ti_sysbios_knl_Task_allBlockedFunc ti_sysbios_knl_Task_allBlockedFunc__C = ((const CT__ti_sysbios_knl_Task_allBlockedFunc)NULL);

/* initStackFlag__C */
const CT__ti_sysbios_knl_Task_initStackFlag ti_sysbios_knl_Task_initStackFlag__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_initStackFlag__C")));
__FAR__ const CT__ti_sysbios_knl_Task_initStackFlag ti_sysbios_knl_Task_initStackFlag__C = 1;

/* checkStackFlag__C */
const CT__ti_sysbios_knl_Task_checkStackFlag ti_sysbios_knl_Task_checkStackFlag__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_checkStackFlag__C")));
__FAR__ const CT__ti_sysbios_knl_Task_checkStackFlag ti_sysbios_knl_Task_checkStackFlag__C = 0;

/* deleteTerminatedTasks__C */
const CT__ti_sysbios_knl_Task_deleteTerminatedTasks ti_sysbios_knl_Task_deleteTerminatedTasks__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_deleteTerminatedTasks__C")));
__FAR__ const CT__ti_sysbios_knl_Task_deleteTerminatedTasks ti_sysbios_knl_Task_deleteTerminatedTasks__C = 0;

/* hooks__C */
const CT__ti_sysbios_knl_Task_hooks ti_sysbios_knl_Task_hooks__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_hooks__C")));
__FAR__ const CT__ti_sysbios_knl_Task_hooks ti_sysbios_knl_Task_hooks__C = {0, 0};

/* moduleStateCheckFxn__C */
const CT__ti_sysbios_knl_Task_moduleStateCheckFxn ti_sysbios_knl_Task_moduleStateCheckFxn__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_moduleStateCheckFxn__C")));
__FAR__ const CT__ti_sysbios_knl_Task_moduleStateCheckFxn ti_sysbios_knl_Task_moduleStateCheckFxn__C = ((const CT__ti_sysbios_knl_Task_moduleStateCheckFxn)(ti_sysbios_knl_Task_moduleStateCheck__I));

/* moduleStateCheckValueFxn__C */
const CT__ti_sysbios_knl_Task_moduleStateCheckValueFxn ti_sysbios_knl_Task_moduleStateCheckValueFxn__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_moduleStateCheckValueFxn__C")));
__FAR__ const CT__ti_sysbios_knl_Task_moduleStateCheckValueFxn ti_sysbios_knl_Task_moduleStateCheckValueFxn__C = ((const CT__ti_sysbios_knl_Task_moduleStateCheckValueFxn)(ti_sysbios_knl_Task_getModuleStateCheckValue__I));

/* moduleStateCheckFlag__C */
const CT__ti_sysbios_knl_Task_moduleStateCheckFlag ti_sysbios_knl_Task_moduleStateCheckFlag__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_moduleStateCheckFlag__C")));
__FAR__ const CT__ti_sysbios_knl_Task_moduleStateCheckFlag ti_sysbios_knl_Task_moduleStateCheckFlag__C = 0;

/* objectCheckFxn__C */
const CT__ti_sysbios_knl_Task_objectCheckFxn ti_sysbios_knl_Task_objectCheckFxn__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_objectCheckFxn__C")));
__FAR__ const CT__ti_sysbios_knl_Task_objectCheckFxn ti_sysbios_knl_Task_objectCheckFxn__C = ((const CT__ti_sysbios_knl_Task_objectCheckFxn)(ti_sysbios_knl_Task_objectCheck__I));

/* objectCheckValueFxn__C */
const CT__ti_sysbios_knl_Task_objectCheckValueFxn ti_sysbios_knl_Task_objectCheckValueFxn__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_objectCheckValueFxn__C")));
__FAR__ const CT__ti_sysbios_knl_Task_objectCheckValueFxn ti_sysbios_knl_Task_objectCheckValueFxn__C = ((const CT__ti_sysbios_knl_Task_objectCheckValueFxn)(ti_sysbios_knl_Task_getObjectCheckValue__I));

/* objectCheckFlag__C */
const CT__ti_sysbios_knl_Task_objectCheckFlag ti_sysbios_knl_Task_objectCheckFlag__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_objectCheckFlag__C")));
__FAR__ const CT__ti_sysbios_knl_Task_objectCheckFlag ti_sysbios_knl_Task_objectCheckFlag__C = 0;

/* numConstructedTasks__C */
const CT__ti_sysbios_knl_Task_numConstructedTasks ti_sysbios_knl_Task_numConstructedTasks__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_numConstructedTasks__C")));
__FAR__ const CT__ti_sysbios_knl_Task_numConstructedTasks ti_sysbios_knl_Task_numConstructedTasks__C = (xdc_UInt)0x0;

/* startupHookFunc__C */
const CT__ti_sysbios_knl_Task_startupHookFunc ti_sysbios_knl_Task_startupHookFunc__C __attribute__ ((section (".rodata_ti_sysbios_knl_Task_startupHookFunc__C")));
__FAR__ const CT__ti_sysbios_knl_Task_startupHookFunc ti_sysbios_knl_Task_startupHookFunc__C = ((const CT__ti_sysbios_knl_Task_startupHookFunc)NULL);


/*
 * ======== ti.sysbios.knl.Task_SupportProxy INITIALIZERS ========
 */


/*
 * ======== ti.sysbios.rom.cortexm.cc26xx.r2.CC26xx INITIALIZERS ========
 */

/* Module__diagsEnabled__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsEnabled ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsEnabled__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsEnabled__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsEnabled ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsEnabled__C = (xdc_Bits32)0x90;

/* Module__diagsIncluded__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsIncluded ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsIncluded__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsIncluded__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsIncluded ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsIncluded__C = (xdc_Bits32)0x90;

/* Module__diagsMask__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsMask ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsMask__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsMask__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsMask ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsMask__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__diagsMask)NULL);

/* Module__gateObj__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__gateObj ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__gateObj__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__gateObj__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__gateObj ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__gateObj__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__gateObj)NULL);

